#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws01/runs/run-uo74hJKAYZfG4GVy

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.security_demo.aws_api_gateway_rest_api.api: Refreshing state... [id=e3vh22gyhl]
module.endpoint_01.aws_iam_role.iam_for_lambda: Refreshing state... [id=tf_lambda_role]
module.security_demo.aws_api_gateway_api_key.api_key: Refreshing state... [id=vo9krzvmif]
module.security_demo.aws_api_gateway_request_validator.validator: Refreshing state... [id=h6gjmy]
module.security_demo.aws_api_gateway_method.options: Refreshing state... [id=agm-e3vh22gyhl-08263f8zuc-OPTIONS]
module.security_demo.aws_api_gateway_deployment.deployment: Refreshing state... [id=byeecu]
module.endpoint_01.aws_api_gateway_model.model: Refreshing state... [id=qwfsgs]
module.endpoint_01.aws_api_gateway_resource.resource: Refreshing state... [id=jdhc55]
module.security_demo.aws_api_gateway_integration.options: Refreshing state... [id=agi-e3vh22gyhl-08263f8zuc-OPTIONS]
module.security_demo.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-e3vh22gyhl-08263f8zuc-OPTIONS-200]
module.endpoint_01.aws_api_gateway_method.options: Refreshing state... [id=agm-e3vh22gyhl-jdhc55-OPTIONS]
module.endpoint_01.aws_api_gateway_method.method: Refreshing state... [id=agm-e3vh22gyhl-jdhc55-POST]
module.security_demo.aws_api_gateway_stage.stage: Refreshing state... [id=ags-e3vh22gyhl-test]
module.security_demo.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-e3vh22gyhl-08263f8zuc-OPTIONS-200]
module.endpoint_01.aws_api_gateway_integration.options: Refreshing state... [id=agi-e3vh22gyhl-jdhc55-OPTIONS]
module.endpoint_01.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-e3vh22gyhl-jdhc55-OPTIONS-200]
module.security_demo.aws_wafv2_web_acl.waf_regional: Refreshing state... [id=3d32b9d4-53a4-431a-b6af-53ae33d291dd]
module.security_demo.aws_api_gateway_usage_plan.usage_plan: Refreshing state... [id=9zgd89]
module.endpoint_01.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-e3vh22gyhl-jdhc55-OPTIONS-200]
module.security_demo.aws_api_gateway_method_settings.all: Refreshing state... [id=e3vh22gyhl-test-*/*]
module.endpoint_01.aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-e3vh22gyhl-jdhc55-POST-200]
module.security_demo.aws_api_gateway_usage_plan_key.plan_key: Refreshing state... [id=vo9krzvmif]
module.endpoint_01.aws_lambda_function.function: Refreshing state... [id=tf_lambda]
module.endpoint_01.aws_api_gateway_integration.integration: Refreshing state... [id=agi-e3vh22gyhl-jdhc55-POST]
module.endpoint_01.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.security_demo.aws_wafv2_web_acl_association.waf_association: Refreshing state... [id=arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/3d32b9d4-53a4-431a-b6af-53ae33d291dd,arn:aws:apigateway:us-east-1::/restapis/e3vh22gyhl/stages/test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.endpoint_01.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "tf_lambda"
      ~ last_modified                  = "2022-01-10T15:38:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "mOpSqO6D/fS2XG1Vh9i+YT320SKF+cTyL6/koXFh//A=" -> "kPxclJktuITUaq0+47/hTYseTJ4tNshA7A1v0D7+2Zc="
        tags                           = {}
        # (19 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.security_demo.aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date  = "2022-01-10T05:04:00Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:531133914787:e3vh22gyhl/" -> (known after apply)
      ~ id            = "byeecu" -> (known after apply)
      ~ invoke_url    = "https://e3vh22gyhl.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "dc24595b6266130c3ce9852c940cdb9883d66da5" -> "e62f265375d8995de7f8b51d0f166569b879b77f"
        }
        # (1 unchanged attribute hidden)
    }

  # module.security_demo.aws_api_gateway_stage.stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "stage" {
      ~ deployment_id         = "byeecu" -> (known after apply)
        id                    = "ags-e3vh22gyhl-test"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.


```

</details>

*Pusher: @fer1035, Action: `pull_request`*